import styles from "./index.module.scss";

export default function Why() {
	return (
		<>
			<section class={styles.container}>
				<h1 class="title">لماذا نقاطع؟ </h1>

				<div class={styles.body}>
					<p>
						تمارس إسرائيل نظام الاستعمار الاستيطاني والفصل العنصري والاحتلال على
						الشعب الفلسطيني. وهذا لن يكون ممكنا إلا بفضل الدعم الدولي. تفشل
						الحكومات في محاسبة إسرائيل، بينما تساعد الشركات والمؤسسات في جميع
						أنحاء العالم إسرائيل على قمع الفلسطينيين.
					</p>
					<p>
						منذ ما يقرب من سبعين عامًا، حرمت إسرائيل الفلسطينيين من حقوقهم
						الأساسية ورفضت الامتثال للقانون الدولي. وتمارس إسرائيل نظام
						الاستعمار الاستيطاني والفصل العنصري والاحتلال على الشعب الفلسطيني.
						وهذا لن يكون ممكنا إلا بفضل الدعم الدولي.
					</p>

					<p>
						تفشل الحكومات في محاسبة إسرائيل، بينما تساعد الشركات والمؤسسات في
						جميع أنحاء العالم إسرائيل على قمع الفلسطينيين. ولأن من هم في السلطة
						يرفضون التحرك لوقف هذا الظلم، فقد دعا المجتمع المدني الفلسطيني إلى
						استجابة المواطنين العالميين للتضامن مع النضال الفلسطيني من أجل
						الحرية والعدالة والمساواة.
					</p>
					<p>
						وتحتل إسرائيل الأراضي الفلسطينية منذ عقود. لقد انتهكوا القانون
						الدولي مرارا وتكرارا، وقاموا بتفعيل الإبادة الجماعية للشعب الفلسطيني
						لعقود من الزمن. يتم تعزيز الاقتصاد الإسرائيلي من خلال الشركات التي
						نجح اللوبي الصهيوني في الوصول إليها أو التأثير على صناع القرار إما
						لنقل العمليات إلى إسرائيل، أو التعاقد مع شركات إسرائيلية، أو شراء
						شركات إسرائيلية ناشئة، وضخ المليارات في الاقتصاد الإسرائيلي.
					</p>

					<p>
						لسنا بحاجة لدعم هذا. لدينا خيارات غير محدودة لكل علامة تجارية
						استهلاكية في السوق. كلما قل إنفاقنا مع الشركات التي تستثمر في
						إسرائيل والدول التي تدعمها، كلما قل استثمار إسرائيل في احتلالها
						لفلسطين.
					</p>
				</div>

				<h2 class="title">هل المقاطعة تُحدِث فارِق فعلاً؟</h2>

				<div class={styles.body}>
					<p>
						نعم. وكانت قرارات الشركة بسحب استثماراتها من إسرائيل في الماضي تُعزى
						بشكل مباشر إلى ضغوط المقاطعة. وحتى لو لم يسحبوا استثماراتهم، فسوف
						يضطرون إلى إنفاق الأموال على العلاقات العامة والضغط لمواجهة
						المقاطعة. وعلى أقل تقدير، سيكون لديهم قدر أقل من أموالنا للاستثمار
						في إسرائيل.{" "}
					</p>
				</div>

				<h2 class="title">هل يجب ان أقاطع كل شئ اليوم؟</h2>

				<div class={styles.body}>
					<p>
						مقاطعة كل شيء ابتداءً من الغد ليست عملية. ليس المقصود من هذه القائمة
						أن تدرسها أو أن تتجول في منزلك وتتخلص من الأشياء. في الواقع، إذا كنت
						تمتلك بالفعل منتجات مدرجة في القائمة، فاحتفظ بها واستخدمها. لقد دفعت
						لهم بالفعل، ولا بأس. ولكن في المرة القادمة التي تريد فيها إجراء
						عملية شراء، تحقق مما إذا كانت موجودة في القائمة، ثم جرب البديل. دعم
						الشركات المحلية التي لا تستثمر في الفصل العنصري والإبادة الجماعية.
					</p>
				</div>

				<h2 class="title">من نقاطع؟</h2>

				<div class={styles.body}>
					<p>
						تشمل القائمة تحديداً كل المنظمات والشركات الداعمة بشكل مباشر للكيان
						مثل ستاربكس وماكدونالدز, والمنتجات المُنتجه في الدول الداعمة مثل
						الولايات المتحدة الامريكية والمملكة المتحدة وفرنسا والمانيا وسويسرا
						والسويد وهولندا واليابان والهند لدعمهم الغير محدود للكيان سواء
						بالسلاح او الأموال. ونقاطع دول النفط العربية (السعودية والإمارات
						والكويت) لإتفاقهم بعدم استغلال صادراتهم للضغط على الدول الداعمة
						للكيان في بداية المجازر الحالية, بالإضافة للأسباب الآتية:
					</p>

					<ul>
						<li>
							السعودية لموقفها المُخزي مع أهلنا الفلسطينيين من إعداد قواعد
							عسكرية أمريكية وتجهيزهم لمضادات صواريخ لحماية إسرائيل من صواريخ
							الحوثيين.
						</li>
						<li>
							الإمارات لدعمهم الإقتصادي و"الإنساني" للكيان في مجازرهم على غزة.
							كما أن الإمارات تعد من اكبر مستوردين السلاح من إسرائيل ومن أكبر
							أصدقائهم بعد الإتفاقيات الإبراهيمية في ٢٠٢٠.
						</li>
						<li>
							البحرين لنفس الأسباب ولدخولهم في الإتفاقيات الإبراهيمية مع
							الإمارات واسرائيل في ٢٠٢٠.
						</li>
						<li>
							قطر لنفس الأسباب ولاحتوائها على أكبر قاعدة عسكرية أمريكية بحرية
							خارج حدود الولايات المتحدة الأمريكية.
						</li>
					</ul>

					<p>
						ونؤكد ان هذه ليست دعوة لمقاطعة الشعوب أو خلق فتنة بين الناس, وإنما
						دليل لإستغلال مصادر صرفنا للضغط على الحكومات والمنظمات المنشأة في
						هذه الدول.
					</p>
				</div>

				<h2 class="title">قانونية المقاطعة</h2>

				<div class={styles.body}>
					<p>
						يختلف القانون المتعلق بالدعوة إلى المقاطعة بين الولايات والبلدان
						المختلفة. لا يمكننا أن نقدم لك المشورة القانونية، لذا يرجى التحقق في
						منطقتك، مما يمكنك أو لا يمكنك قوله. ومع ذلك، لديك الحق تمامًا في
						اتخاذ القرارات بشأن المكان الذي تنفق فيه أموالك الخاصة.
					</p>
				</div>
			</section>
		</>
	);
}
