import { PWA_INSTALL_GUIDE } from "~constants/documents";

import styles from "./index.module.scss";

export default function FAQ() {
	return (
		<>
			<section class={styles.container}>
				<h1 class="title">اسئلة وأجوبة</h1>

				<div class={styles.body}>
					<dl>
						<dt>كيفية تثبيت التطبيق؟</dt>
						<dd>
							يمكنكم تثبيت بَدِيل عن طريق القائمة الخاصة بالمتصفح. رجاء إتباع
							التعليمات المذكورة في{" "}
							<a
								href={PWA_INSTALL_GUIDE}
								rel="noopener noreferrer"
								target="_blank"
							>
								التعليمات
							</a>
							.
						</dd>

						<dt>لماذا لا يوجد صور للمنتجات؟</dt>
						<dd>
							صور المنتجات قد تعرضنا للمسائل القانونية، وهذا أمر لا نرغب في
							تحمله تمامًا. نفكر حاليًا في إضافة صور للبدائل فقط.
						</dd>

						<dt>لماذا لا يوجد ماسح باركود (Barcode Scanner)؟</dt>
						<dd>
							وظيفة ماسحات الباركود تعتمد على وجود قاعدة بيانات تحتوي على رمز
							Barcode الخاص بكل مُنتج والذي يكون خاص بدولة الإنتاج ومنشأ الشركة
							المُصنِّعة. مما قد يؤدي لتضخيم حجم البيانات بشكل غير مرحب به أو
							تحديد دولة عمل "بَدِيل". ونقوم حالياً ببحث الحلول لهذه المُشكلة.
						</dd>

						<dt>لماذا لا يوجد خيار لتقييم البدائل حسب الجودة وما إلى ذلك؟</dt>
						<dd>
							إنَّ نظامًا كهذا قد يسمح للمنافسين بتشويه سمعة بعض المنتجات
							والترويج لمنتجات أخرى، وبدون نظام للمراجعات الحقيقية لن نكون
							قادرين على توفير معلومات واضحة حول سبب حصول المنتجات على التقييمات
							التي حصلت عليها. وبالتالي، سيكون الضرر أكبر من النفع.
						</dd>

						<dt>البيانات غير متوفرة، ماذا يمكن القيام به؟</dt>
						<dd>
							إذا ظهرت لك رسالة خطأ من الموقع باللون الأحمر فهذا يعني أن
							البيانات تم منعها من التحميل. تأكد من أن متصفحك لا يمنع الطلبات من
							مواقع جوجل. قد تكون خصائص الحماية القصوى للخصوصية في متصفح مثل
							فايرفوكس هي السبب في ذلك. قد يكون المشكلة أيضًا في برامج منع
							الإعلانات (Adblock).
						</dd>

						<dt>لا يظهر مُنتجات؟</dt>
						<dd>
							تحققوا من عدم اختيار قسم محدد. يمكنكم التحقق من ذلك عن طريق الضغط
							على زر "إلغاء التصفية" الموجود تحت حقل البحث.
						</dd>

						<dt>كيف يمكنني المساعدة؟</dt>
						<dd>
							يمكنكم المساعدة عن طريق إضافة منتجات إلى الموقع أو تقديم اقتراحات
							من خلال الرابط الموجود في أعلى الموقع. بالإضافة إلى ذلك، يمكنكم
							المساهمة في تطوير البرمجيات من خلال
							<a
								href="https://github.com/KL13NT/badeel"
								target="_blank"
								rel="noopener noreferrer"
							>
								GitHub
							</a>{" "}
							الخاص بنا.
						</dd>
					</dl>
				</div>
			</section>
		</>
	);
}
