import styles from "./index.module.scss";

export default function FAQ() {
	return (
		<>
			<section class={styles.container}>
				<h1 class="title">اسئلة وأجوبة</h1>

				<div class={styles.body}>
					<dl>
						<dt>ليه مفيش صور للمُنتجات؟</dt>
						<dd>
							صور المُنتجات ممكن تعرضنا للمُساءلات القانونية ودي حاجة مش حابين
							نتعرضلها خالص.
						</dd>

						<dt>ليه مفيش اوبشن نقيّم البدائل حسب الجودة وهكذا؟</dt>
						<dd>
							سيستم زي ده ممكن يسمح للُمنافسين بإنهم يغرقوا مُنتجات مُعينة
							ويرفعوا من مُنتجات تانية, ومن غير نظام مُراجعات حقيقية مش هنقدر
							نوَّصل معلومة واضحة عن ليه المُنتجات واخدة التقييمات اللي واخداها.
							وبالتالي ضرره هيبقى اكبر من نفعُه.
						</dd>

						<dt>البيانات مش بتحمل, ايه العمل؟</dt>
						<dd>
							لو بيظهرلك رسالة خطأ من الموقع باللون الأحمر ده معناه ان البيانات
							اتمنعت من انها تتحمل. إتأكد ان المتصفح الخاص بيك مش بيمنع الطلب من
							مواقع جووجل. خواص الحماية القصوى للخصوصية في مُتصفح زي فايرفوكس
							مُمكن يكون السبب في ده. من الممكن كمان ان يكون المشكلة في مانع
							الإعلانات (Adblock).
						</dd>

						<dt>مش بيظهر مُنتجات؟</dt>
						<dd>
							إتأكدوا انكوا مش مختارين قسم بعينه. تقدروا تتأكدوا من ده عن طريق
							الضغط على زرار "إلغاء التصفية" تحت حقل إدخال البحث.
						</dd>

						<dt>إزاي أقدر أساعد؟</dt>
						<dd>
							تقدروا تساعدوا عن طريق إضافة مُنتجات للموقع أو المقترحات من خلال
							الرابط الموجود أعلى الموقع. كمان تقدروا تساهموا في البرمجيات من
							خلال الـ
							<a
								href="https://github.com/KL13NT/badeel"
								target="_blank"
								rel="noopener noreferrer"
							>
								GitHub
							</a>{" "}
							الخاص بنا.
						</dd>

						<dt>هل هتضيفوا QR Scanner؟</dt>
						<dd>
							الـ QR Scanners وظيفتهم بتعتمد على توفر قاعدة بيانات بالـ QR Code
							الخاص بكل منتج, ودي حاجة مش متوفرة لينا حالياً للأسف والوصول ليها
							صعب جداً. على الرغم من كده احنا ناويين نضيف QR Scanner ولكن لما
							يبقى معانا داتا كافية الاول.
							<br />
							طب ليه منعملوش حسب دولة الانتاج وخلاص؟
							<br />
							لإن ببساطة مينفعش نعتمد على كود الدولة اللي موجود في الـ QR Code.
							ده لإن الكود ده بيكون خاص ببلد الإنتاج وليس دولة المنشأ. فممكن
							يكون منتج واخد QR Code امريكي ولكن الشركة اصلها عربي مثلاً,
							وبالتالي تحديد هو داعم ولا لا بيكون صعب.
							<br />
							وإحنا عموماً بندور في حلول للمشكلة دي.
						</dd>

						<dt>ليه الموقع مش بيشتغل من غير جافاسكربت؟ (سؤال تقني)</dt>
						<dd>
							ده WebApp, والوظائف بتاعته كلها معتمدة على الاكشن اللي المستخدمين
							بياخدوها من بحث لإعادة ترتيب الخ, وبالتالي مش منطقي اننا نعمل
							infrastructure عشان نشغله SSR ومش بنفيد المشروع خالص.
							<br />
							الحاجات الوحيدة اللي ممكن تستفيد من حاجة زي كده هي الصفحات زي
							الاسامي وصفحة الاسئلة دي, بس ده مجهود ميستدعيناش اننا نبذله,
							وبنفضّل دايماً نبذل المجهود ده في حاجات تانية ليها تأثير اكبر
							للمستخدمين.
						</dd>
					</dl>
				</div>
			</section>
		</>
	);
}
